#+SEQ_TODO: TODO STARTED | DONE CANCELLED

** STARTED Port openocd commands to Rust/probe-rs and replicate behavior
   DEADLINE: <2021-02-11 Thu>
   :LOGBOOK:
   CLOCK: [2021-02-10 Wed 15:01]
   CLOCK: [2021-02-09 Tue 20:20]--[2021-02-09 Tue 21:32] =>  1:12
   CLOCK: [2021-02-09 Tue 18:40]--[2021-02-09 Tue 19:00] =>  0:20
   CLOCK: [2021-02-09 Tue 17:23]--[2021-02-09 Tue 18:22] =>  0:59
   CLOCK: [2021-02-09 Tue 15:03]--[2021-02-09 Tue 16:50] =>  1:47
   CLOCK: [2021-02-08 Mon 22:23]--[2021-02-08 Mon 22:43] =>  0:20
   CLOCK: [2021-02-08 Mon 21:39]--[2021-02-08 Mon 21:53] =>  0:14
   CLOCK: [2021-02-08 Mon 16:16]--[2021-02-08 Mon 19:18] =>  3:02
   :END:
   We want to ditch openocd in favour of ~probe-ps~. This may require
   some changes to the code base because ITM support is presently marked
   as "alpha". In essence, we need to translate whatever openocd does
   OOTB and the gdb commands (?) to a ~probe-rs~ environment.
   - Later these commands will be ported to probe.rs
   - Make sure to find manual references for all commands.

   *Build with symbols and -O0 and reverse engineer script*
   Functions of interest (when running as =openocd -d -f openocd.cfg=):
   - =target_write_u32= in =target.c:2482=
   - =adapter_write_memory= in =hla_target.c:783=
   Breakpoint these and inspect during runtime. Are there any other
   functions that write to target?
   *Must we concern ourselves with what probe-rs already writes?*

   *Below: what openocd does on startup*
   - Debug -302 :: checks CPUID and floating-point features, host-side setup
   - Debug 303-306 :: sets ~DHCSR = 0xa05f0001~; unlocks the register
     with ~0xa05f~ and enables debug-mode.
   - Debug 307-308 :: sets ~DEMCR = 0x01000000~; sets TRCENA: globally
     enables all DWT and ITM units.
   - *We go through Flash Patch and Break (FPB) unit*
   - Debug 309-310 :: reads ~FP_CTRL = 0x00000260~ (Flash Patch control
     register).
   - Debug 311-327 :: (probably) nulls the FPB comparator registers.
   - Debug 328-330 :: reads ~DWT_CTRL = 0x40000000~.
   - Debug 331-333 :: Reads some CoreSight management register (offset
     0xFBC, RO). Some ~DWT_DEVARCH = 0x0~.
   - Debug 334-335 :: Nulls ~DWT_FUNCTIONn~, $n = 0, ... 3$; disables them.
   - Debug 344-353 :: executes ~examine-end~:
     #+BEGIN_SRC tcl
       # Enable debug during low power modes (uses more power)
       # DBGMCU_CR |= DBG_STANDBY | DBG_STOP | DBG_SLEEP
       mmw 0xE0042004 0x00000007 0

       # Stop watchdog counters during halt
       # DBGMCU_APB1_FZ |= DBG_IWDG_STOP | DBG_WWDG_STOP
       mmw 0xE0042008 0x00001800 0
     #+END_SRC
   - Debug 354-377 :: registers internal flash commands. Nothing
     seemingly written to device.
   - Debug 378-380 :: Initializes PLDs (?).
   - Debug 381-382 :: Starts GDB server.
   - Debug 383-- :: Shuts down.

